GRID_SIZE = 20
GRID_WIDTH = 20
GRID_HEIGHT = 15
SIDEBAR_WIDTH = 5
CANVAS_VIEW_WIDTH = 25   # 显示窗口宽度（格数）
CANVAS_VIEW_HEIGHT = 25  # 显示窗口高度（格数）
active_blocks = []
inactive_blocks = []
canvas_list = ["上", "下", "左", "右"]
canvas_size_dict = {
    "上": (45, 45),
    "下": (45, 45),
    "左": (45, 45),
    "右": (45, 45),
}
canvas_forbidden_dict = {       # (x1,y1), (x2,y2)  # 禁止放置区域
    "上":
    [                           
        ((0, 0), (5, 17)),      # 更上面长16高17
        ((18, 0), (25, 17)),
        ((0, 22), (6, 34)),     # 上面宽12高20
        ((17, 22), (25, 34)),
    ],
    "下":
    [
        ((0, 0), (9, 19)),      # 下面可通行区长10高20
        ((0, 0), (17, 18)),     # 更下面的可通行区长18高19
    ],                 
    "左": 
    [
        ((0, 0), (7, 9)),       # 左边的可通行区长8高10
        ((0, 0), (20, 15)),     # 更左边的可通行区长21高16
    ],                               
    "右":
    [
        ((0, 0), (9, 19)),      # 右边的可通行区长10高20
        ((0, 0), (18, 15)),     # 更右边的可通行区长19高16
    ],
}
