GRID_SIZE = 20
GRID_WIDTH = 20
GRID_HEIGHT = 15
SIDEBAR_WIDTH = 5
CANVAS_VIEW_WIDTH = 30   # 显示窗口宽度（格数）
CANVAS_VIEW_HEIGHT = 30  # 显示窗口高度（格数）
active_blocks = []
inactive_blocks = []
canvas_list = ["上", "下", "左", "右"]
canvas_size_dict = {
    "上": (45, 45),
    "下": (45, 45),
    "左": (45, 45),
    "右": (45, 45),
}
canvas_forbidden_dict = {
    "上": [                                 # (x1,y1), (x2,y2)  # 禁止放置区域
        ((0, 0), (5, 17)),
        ((18, 0), (25, 17)),
        ((0, 22), (6,34)),
        ((17, 22), (25, 34)),
    ],
    #上面宽12高20   更上面宽16高17
    "下": [((5, 5), (10, 8))],                 
    #下面长10高20   更下面宽18高19   
    "左": [],                               
    #左边长8高10    更左边长21高16
    "右": [(0, 0), (1, 1)],                 
    #右边长10高20   更右边长19高16
}